app/controllers/follows_controller.rb

INSERT INTO "follows" ("user_id", "at_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["at_user_id", 1], ["created_at", "2019-07-10 07:23:03.033162"], ["updated_at", "2019-07-10 07:23:03.033162"]]
---
    def create
        @follow = Follow.new(user_id: @current_user.id, at_user_id: params[:at_user_id])
        @follow.save

SELECT  "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."at_user_id" = ? LIMIT ?  [["user_id", 2], ["at_user_id", 1], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]
---
    def destroy
        @follow = Follow.find_by(user_id: @current_user.id, at_user_id: params[:at_user_id])
        @follow.destroy