app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "profile", "password", "account_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(name: params[:name], account_name: params[:account_name],
      email: params[:email], password: params[:password],image_name: "default_user.jpg",profile: params[:profile])
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."account_name" = ? AND "users"."password" = ? LIMIT ?  [["account_name", "a"], ["password", "a"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(account_name: params[:account_name],password:params[:password])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? LIMIT ?  [["post_id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def destroy
    d_user = User.find_by(id: params[:id])
    d_posts = Post.where(user_id: d_user.id)

    #削除したアカウントの投稿とそれへのいいねを削除
    d_posts.each do |post|
      if like = Like.find_by(post_id: post.id)
        like.destroy
      end
      post.destroy
    end

    d_user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = ?  [["user_id", 1]]
---
  def follows
    @user = User.find_by(id: params[:id])
    @follows = Follow.where(user_id: @user.id)